pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_crypto.h
    struct {
      __IOM uint32_t dma_wait_cycle : 16;       /*!< [15..0] Software Reset                                         */
      __IOM uint32_t arbiter_mode : 1;          /*!< [16..16] dma arbiter mode: 1'b0 : round-robin 1'b1 : detect
                                                 *   fifo wasted level
                                                 */
      __IM  uint32_t            : 3;
      __IOM uint32_t debug_port_sel : 4;        /*!< [23..20] Debug port selection: 4'd0 : engine_dbg,
                                                 *   4'd1 : dma_lexra_dbg, 4'd2 : dma_rx_dbg, 4'd3 : dma_tx_dbg
                                                 */
      __IOM uint32_t engine_clk_en : 1;         /*!< [24..24] Ipsec Engine clock enable                             */

      __IM  uint32_t            : 6;
      __IOM uint32_t debug_wb   : 1;            /*!< [31..31] Debug : write back mode                               */
    } ipscsr_debug_reg_b;
  } ;

  union {
    __IOM uint16_t ipscsr_err_stats_reg;        /*!< (@ 0x0000001C) IPSec Command/Status Register, for error status */

    struct {
      __IOM uint16_t src_err0   : 1;            /*!< [0..0] Source Descriptor Error 0 interrupt First segment descriptor
                                                 *   is not set (FS=0), when descriptor is pointing to the first
                                                 *   segment of the packet. (or) First segment descriptor is
                                                 *   set (FS=1), when descriptor is polling to the first segment
                                                 *   of the packet. Write 1 to clear
                                                 */
      __IOM uint16_t src_err1   : 1;            /*!< [1..1] Source Descriptor Error 1 interrupt Last segment descriptor
                                                 *   is not set (LS=1), when descriptor is pointing to the first
                                                 *   segment of the packet. Write 1 to clear
                                                 */
      __IOM uint16_t src_err2   : 1;            /*!< [2..2] Source Descriptor Error 2 interrupt 1. Source Descriptor
                                                 *   Starting Address error(SDSA[1:0]!=2'd0) 2. memory protection
                                                 *   event Write 1 to clear
                                                 */
      __IOM uint16_t src_err3   : 1;            /*!< [3..3] Source Descriptor Error 3 interrupt Length error :
                                                 *   1. first descriptor & (CL!=3)
                                                 *   2. ((CL=0)&(kl==0)&(il==0)&(pl==0)&(shil==0)
                                                 *   Write 1 to clear
                                                 */
      __IOM uint16_t src_err4   : 1;            /*!< [4..4] Source Descriptor Error 4 interrupt Source Data Buffer
                                                 *   Pointer error(SDDB[1:0]!=2'd0) Write 1 to clear
                                                 */
      __IOM uint16_t src_err5   : 1;            /*!< [5..5] Source Descriptor Error 5 interrupt Data length = a2eo(epl)
                                                 *   + enl + apl = 0 Write 1 to clear
                                                 */
      __IOM uint16_t src_err6   : 1;            /*!< [6..6] Source Descriptor Error 6 interrupt Sum(a2eo)!=header
                                                 *   total length Write 1 to clear
                                                 */
      __IOM uint16_t src_err7   : 1;            /*!< [7..7] Source Descriptor Error 7 interrupt Sum(enl)!=encryption
                                                 *   total length Write 1 to clear
                                                 */
      __IOM uint16_t src_err8   : 1;            /*!< [8..8] Source Descriptor Error 8 interrupt Sum(apl)!=hash padding
                                                 *   total length Write 1 to clear
                                                 */
      __IOM uint16_t src_err9   : 1;            /*!< [9..9] Source Descriptor Error 9 interrupt Sum(enl)!=encryption
                                                 *   padding total length Write 1 to clear
                                                 */
      __IOM uint16_t des_err1   : 1;            /*!< [10..10] Destination Descriptor Error 1 interrupt 1. Destination
                                                 *   Descriptor Starting Address error(DDSA[1:0]!=2'd0) 2. memory
                                                 *   protection error Write 1 to clear
                                                 */
      __IOM uint16_t des_err2   : 1;            /*!< [11..11] Destination Descriptor Error 2 interrupt (ENC=1'b1),
                                                 *   when only active hash engine Write 1 to clear
                                                 */
      __IOM uint16_t des_err3   : 1;            /*!< [12..12] Destination Descriptor Error 2 interrupt (ENC=1'b0),
                                                 *   when only active encryption engine Write 1 to clear
                                                 */
      __IOM uint16_t des_err4   : 1;            /*!< [13..13] Destination Descriptor Error 4 interrupt 1. (enl_sum
                                                 *   > enc_len) 2. (enl==0) & (apl==0) Write 1 to clear
                                                 */
      __IOM uint16_t des_err5   : 1;            /*!< [14..14] Destination Descriptor Error 5 interrupt 1. md5: adl>16
                                                 *   2. sha1: adl>20 3. sha224: adl>28 4. sha256: adl>32 5.
                                                 *   sha384: adl>48 6. sha512: adl>64 Write 1 to clear
                                                 */
      __IOM uint16_t des_err6   : 1;            /*!< [15..15] Destination Descriptor Error 6 interrupt
                                                 *   when set sequential hash 1. md5: adl!=16 2. sha1: adl!=20
                                                 *   3. sha224/256: adl!=32 4. sha384/512: adl!=64 Write 1 to clear
                                                 */
    } ipscsr_err_stats_reg_b;
  } ;
  __IM  uint16_t  RESERVED1;

  union {
    __IM  uint32_t ipscsr_a2eo_sum_reg;         /*!< (@ 0x00000020) IPSec Command/Status Register, for sum of a2eo             */
    
