pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_crypto.h
    struct {
      __IM  uint32_t sta_sdes_cmd1 : 32;        /*!< [31..0] Source descriptor command 1 status values                         */
    } ipscsr_sta_sdes_cmd1_b;
  } ;
  
  union {
    __IM  uint32_t ipscsr_sta_sdes_cmd2;        /*!< (@ 0x0000005C) IPSec Command/Status Register, for source descriptor
                                                                    command 2 status                                           */
    
    struct {
      __IM  uint32_t sta_sdes_cmd2 : 32;        /*!< [31..0] Source descriptor command 2 status values                         */
    } ipscsr_sta_sdes_cmd2_b;
  } ;
  
  union {
    __IM  uint32_t ipscsr_sta_sdes_cmd3;        /*!< (@ 0x00000060) IPSec Command/Status Register, for source descriptor
                                                                    command 3 status                                           */
    
    struct {
      __IM  uint32_t sta_sdes_cmd3 : 32;        /*!< [31..0] Source descriptor command 3 status values                         */
    } ipscsr_sta_sdes_cmd3_b;
  } ;
  
  union {
    __IM  uint32_t ipscsr_sta_ddes_cfg_reg;     /*!< (@ 0x00000064) IPSec Command/Status Register, for destination
                                                                    descriptor configure status                                */
    
    struct {
      __IM  uint32_t sta_ddes_cfg : 32;         /*!< [31..0] Destination descriptor configure status values                    */
    } ipscsr_sta_ddes_cfg_reg_b;
  } ;
  
  union {
    __IM  uint32_t ipscsr_sta_ddes_ptr_reg;     /*!< (@ 0x00000068) IPSec Command/Status Register, for destination
                                                                    descriptor pointer status                                  */
    
    struct {
      __IM  uint32_t sta_ddes_ptr : 32;         /*!< [31..0] Destination descriptor pointer status values                      */
    } ipscsr_sta_ddes_ptr_reg_b;
  } ;
  __IM  uint32_t  RESERVED3[37];

  union {
    __OM  uint32_t crc_rst_reg;                 /*!< (@ 0x00000100) crc reset                                       */

    struct {
      __OM  uint32_t rst        : 1;            /*!< [0..0] CRC reset                                               */
    } crc_rst_reg_b;
  } ;

  union {
    __IOM uint32_t crc_op_reg;                  /*!< (@ 0x00000104) crc operation                                   */

    struct {
      __IOM uint32_t crc_iswap  : 3;            /*!< [2..0] swap input data                                         */
      __IOM uint32_t crc_oswap  : 1;            /*!< [3..3] swap output data                                        */
      __IOM uint32_t crc_sel    : 3;            /*!< [6..4] crc sel                                                 */
      __IOM uint32_t crc_dma    : 1;            /*!< [7..7] DMA mode                                                */
      __IOM uint32_t crc_be     : 2;            /*!< [9..8] big endian                                              */

      __IM  uint32_t            : 2;
      __IOM uint32_t crc_last   : 1;            /*!< [12..12] crc last                                              */

      __IM  uint32_t            : 3;
      __IOM uint32_t crc_length : 16;           /*!< [31..16] length                                                */
    } crc_op_reg_b;
  } ;

  union {
    __IOM uint32_t crc_poly_reg;                /*!< (@ 0x00000108) CRC polynomia register                          */

    struct {
      __IOM uint32_t crc_poly   : 32;           /*!< [31..0] crc polynomial coefficients                            */
    } crc_poly_reg_b;
  } ;

  union {
    __IOM uint32_t crc_iv_reg;                  /*!< (@ 0x0000010C) CRC initial value register                      */

    struct {
      __IOM uint32_t crc_init   : 32;           /*!< [31..0] crc init value                                         */
    } crc_iv_reg_b;
  } ;

  union {
    __IOM uint32_t crc_oxor_reg;                /*!< (@ 0x00000110) CRC initial value register                      */

    struct {
      __IOM uint32_t crc_oxor   : 32;           /*!< [31..0] if output xor mode                                     */
    } crc_oxor_reg_b;
  } ;

  union {
    __IOM uint32_t crc_data_reg;                /*!< (@ 0x00000114) CRC data register                               */

    struct {
      __IOM uint32_t crc_data   : 32;           /*!< [31..0] din - Command mode : DMA==1'b0 SDBP - Source Data Buffer
                                                 *   Pointer : DMA==1'b1
                                                 */
    } crc_data_reg_b;
  } ;

  union {
    __IOM uint32_t crc_stat_reg;                /*!< (@ 0x00000118) CRC status register                             */

    struct {
      __IM  uint32_t busy       : 1;            /*!< [0..0] still busy in previous execution                        */
      __IOM  uint32_t crc_ok     : 1;           /*!< [1..1] finish execution                                        */
      __IOM uint32_t crc_intr_mask : 1;         /*!< [2..2] interrupt mask                                          */
      __OM  uint32_t crc_little_endian : 1;     /*!< [3..3] little endian                                           */
    } crc_stat_reg_b;
  } ;

  union {
    __IM  uint32_t crc_result_reg;              /*!< (@ 0x0000011C) CRC result register                             */

    struct {
      __IM  uint32_t crc_out    : 32;           /*!< [31..0] output result                                          */
    } crc_result_reg_b;
  } ;

  union {
    __IM  uint32_t crc_count_reg;               /*!< (@ 0x00000120) CRC count register                              */

    struct {
      __IM  uint32_t crc_cnt    : 16;           /*!< [15..0] count number in bytes                                  */
    } crc_count_reg_b;
  } ;

  union {
    __IM  uint32_t crc_dma_rx_dbg_reg;          /*!< (@ 0x00000124) CRC DMA rx dbg register                                    */
    
