pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_crypto.h
    struct {
      __IM  uint32_t crc_dma_rx_dbg : 32;       /*!< [31..0] CRC DMA rx debug values                                           */
    } crc_dma_rx_dbg_reg_b;
  } ;
  __IM  uint32_t  RESERVED4[950];

  union {
    __IOM uint32_t dstdesc_status_reg;          /*!< (@ 0x00001000) destination descriptor status                   */

    struct {
      __IM  uint32_t fifo_empty_cnt : 8;        /*!< [7..0] Destination Descriptor FIFO empty counter               */
      __IM  uint32_t dwptr      : 8;            /*!< [15..8] Destination Descriptor FIFO write pointer              */
      __IM  uint32_t drptr      : 8;            /*!< [23..16] Destination Descriptor FIFO read pointer              */
      __IOM uint32_t dst_fail   : 1;            /*!< [24..24] Destination Descriptor fail interrupt                 */
      __IM  uint32_t dst_fail_status : 2;       /*!< [26..25] Destination Descriptor fail status                    */
      __IOM uint32_t dst_fail_m : 1;            /*!< [27..27] Destination Descriptor fail interrupt mask            */

      __IM  uint32_t            : 3;
      __IOM uint32_t dst_rst    : 1;            /*!< [31..31] Destination Descriptor reset                          */
    } dstdesc_status_reg_b;
  } ;

  union {
    __IOM uint32_t ddfw_reg;                    /*!< (@ 0x00001004) destination descriptor first word               */

    struct {
      __IOM uint32_t ddfw       : 32;           /*!< [31..0] IPSec Destination Descriptor first word                */
    } ddfw_reg_b;
  } ;

  union {
    __IOM uint32_t ddsw_reg;                    /*!< (@ 0x00001008) destination descriptor second word              */

    struct {
      __IOM uint32_t ddsw       : 32;           /*!< [31..0] IPSec Destination Descriptor second word               */
    } ddsw_reg_b;
  } ;

  union {
    __IOM uint32_t desc_pkt_conf_reg;           /*!< (@ 0x0000100C) descriptor packet setting                       */

    struct {
      __IOM uint32_t dbg_sptr   : 8;            /*!< [7..0] Source Descriptor FIFO empty counter                    */
      __IOM uint32_t dbg_dptr   : 8;            /*!< [15..8] Destination Descriptor FIFO write pointer              */
      __IM  uint32_t pk_arbiter : 2;            /*!< [17..16] Packet arbiter 2'd0 : bus1, 2'd1 : bus2, 2'd2 : bus3  */

      __IM  uint32_t            : 6;
      __IOM uint32_t bus1_priority_th : 2;      /*!< [25..24] Bus1 priority threshold                               */
      __IOM uint32_t bus2_priority_th : 2;      /*!< [27..26] Bus2 priority threshold                               */
      __IOM uint32_t bus3_priority_th : 2;      /*!< [29..28] Bus3 priority threshold                               */
      __IOM uint32_t pk_arbiter_mode : 2;       /*!< [31..30] Packet arbiter mode                                   */
    } desc_pkt_conf_reg_b;
  } ;
} CRYPTO_Type;                                  /*!< Size = 4112 (0x1010)                    */

/** @} */ /* End of group crypto_device_reg */

/* ================================================================================================================ */
/* ================                          Device Specific Peripheral Address Map                           ===== */
/* ================================================================================================================ */


/** @addtogroup device_crypto_addr Crypto Engine Register Base Address
 *  @ingroup hs_hal_crypto
 *  @{
 */

#define CRYPTO_S_BASE                 0x50070000UL
#define CRYPTO_NS_BASE                0x40070000UL

/** @} */ /* End of group device_crypto_addr */


/* ================================================================================================================ */
/* ================                                  Peripheral declaration                                   ===== */
/* ================================================================================================================ */


/** @addtogroup device_crypto_decl Crypto Engine Device Type
 *  @ingroup hs_hal_crypto
 *  @{
 */

#define CRYPTO_S_MODULE                         ((CRYPTO_Type *)            CRYPTO_S_BASE)
#define CRYPTO_NS_MODULE                        ((CRYPTO_Type *)            CRYPTO_NS_BASE)

/** @} */ /* End of group device_crypto_decl */

/// @endcond /* End of condition DOXYGEN_CRYPTO_REG_TYPE */
#ifdef __cplusplus
}
#endif

#endif /* RTL8710C_CRYPTO_H */

/** @} */ /* End of group hs_hal_crypto */

